data <- c(10,15,20,25,30,15,20,25,25,10)
mean_value <- mean(data)
median_value <- median(data)
max_value <- max(data)
min_value <- min(data)
CAGR = sqrt(sqrt((674/542)*(841/674)*(966/841)*(1026/966)))-1
HM = (2*100*50)/(100+50)
Hm2 = 2/((1/80)+(1/20))
hm3 = 2/((1/50)+(1/50))           
hm4 = 2/((1/0)+(1/100))           
Game = 5/((1/10)+(1/30)+(1/50)+(1/70)+(1/100))

#문제1
A_Mid_test_AVG = (75+88+91+68+82)/5
A_Final_test_AVG = (60+87+55+47+92)/5

#문제2
A_Mid = (91+88+82)/3
A_final = (60+87+55)/3

#문제3
std_1 = (75*0.5)+(60*0.3)
std_2 = (88*0.5)+(87*0.3)
std_3 = (91*0.5)+(55*0.3)
std_4 = (68*0.5)+(47*0.3)
std_5 = (82*0.5)+(92*0.3)
all_std = c(std_1, std_2, std_3, std_4, std_5)
sort(all_std)

#문제4
sqrt((5.5/5)*(7/5.5)*(10/7)) #근데 이거 3있어야함

# 오늘한것 = 기술통계
# 평균을 왜 구할까? 중심경향을 측정하기 위해서!!
# 데이터 추출 -> 데이터 구조 파악하기 위해 중심 경향 측정